//? Створити розмітку з двома текстовими полями та кнопкою.
//? При натисканні на кнопку перевіряти, чи обидва поля містять значення,
//? якщо так, то виводити повідомлення "Обидва поля заповнені",
//? якщо ні — "Не всі поля заповнені".

//! Код виконаного завдання

let form1 = prompt("Заповніть цю форму");    

let formFirst = prompt("Заповніть цю форму");

if (form1 && formFirst) {
    alert("Обидва поля заповнені")
} else if (form1 === null && formFirst === null || form1.trim() === "" && formFirst.trim() === "") {
    alert("Ви не ввели текст!")
} else {
    alert("Не всі поля заповнені")
};

//? Створити розмітку з двома числовими полями та кнопкою.При натисканні на кнопку перевіряти,
//? чи сума значень полів більша за 10, якщо так, то виводити
//?  повідомлення "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".

//! Код виконаного завдання

let form2 = prompt("Введіть будь-яке число");
let formSecond = prompt("Введіть ще одне число");

if (form2 === null || formSecond === null || form2.trim() === "" || formSecond.trim() === "") {
    alert("Поля немають бути пустими!")
}  else if (isNaN(Number(form2)) || isNaN(Number(formSecond))) {
    alert("Це не число");
} else {
    form2 = Number(form2);
    formSecond = Number(formSecond);
    if (form2 > 10 && formSecond > 10) {
        alert("Сума більша за 10");
    } else {
        alert("Сума менша або дорівнює 10");
    }
}

//? Створити розмітку з текстовим полем та кнопкою.При натисканні на кнопку перевіряти,
//?     чи введений текст містить слово "JavaScript", якщо так, то виводити повідомлення
//?  "Текст містить слово JavaScript", якщо ні — "Текст не містить слово JavaScript".

//! Код виконаного завдання

const form3 = prompt("Заповніть форму");

console.log(form3.includes("JavaScript"));

if (form3.includes("JavaScript")) {
    alert("Текст містить слово JavaScript")
} else {
    alert("Текст не містить слово JavaScript")
};


//? Створити розмітку з формою з полями введення та кнопкою.
//? При натисканні на кнопку перевіряти, чи введене число більше
//?  за 10 та менше за 20, якщо так, то виводити повідомлення "Число входить в діапазон від 10 до 20",
//?     якщо ні — "Число не входить в діапазон від 10 до 20".

//! Код виконаного завдання

const form4 = prompt("Введіть число");

if (form4 > 10 && form4 < 20) {
    alert("Число входить в діапазон від 10 до 20")
} else if (form4 === null || form4.trim() === "") {
    alert("Це не число");
} else {
   alert("Число не входить в діапазон від 10 до 20")
};


//? Створити розмітку з формою з полями введення та кнопкою.
//? При натисканні на кнопку перевіряти, чи введені дані правильно заповнені,
//? якщо так, то перенаправляти на іншу сторінку,
//? якщо ні — виводити повідомлення про помилку.
//? Правильно заповнені дані: ім'я містить не менше 3 символів, email містить символ @ та крапку після неї,
//? пароль містить не менше 6 символів.

//! Код виконаного завдання

const form5 = prompt("Введіть ім'я")

if (form5.trim() === "") {
    alert("Поле не має бути пустим!");
} else if (form5.trim().length < 3) {
    alert("Ім'я має містити 3 символи або більше і без пробілів!");
} else {
    alert("Вітаємо! ", form5)
};

const form6 = prompt("Введіть email")

if (!form6) {
    alert("Поле не може бути порожнім!");
} else if (form6.length < 15) {
    alert("Email закороткий!");
} else if (form6.includes("@") && form6.includes(".")) {
    alert("Вітаємо!");
} else {
    alert(`Email повинен містити "@" та "."`);
}

const form7 = prompt("Введіть пароль")

if (form7 === null || form7.trim() === "") {
    alert("Це поле не має бути пустим!");
} else if (form7.trim().length < 6) {
    alert("Пароль має містити 6 символів або більше та без пробілів!");
} else {
    alert("Вітаємо!");
}
