console.log('Lesson-1 JS');

//? Створити змінну з іменем age і присвоїти їй значення свого віку.
//?  Вивести значення цієї змінної в консоль.

//! Код виконаного завдання

const age = 14;

console.log("I'm", age);

//? Створити змінну з іменем name і присвоїти їй значення свого імені.
//? Вивести значення цієї змінної в консоль.

//! Код виконаного завдання

const name = "Mykhailo";

console.log("My name is", name)

//? Створити змінну з іменем isStudent і присвоїти їй значення true або false,
//? залежно від того, чи є студентом. Вивести значення цієї змінної в консоль.

//! Код виконаного завдання

const isStudent = true;

console.log("isStudent", isStudent);

//? Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою.
//? Вивести цей рядок в консоль.

//! Код виконаного завдання

const myString = "не відкладай на завтра те, що можеш зробити сьогодні";

console.log("My favorite string is", myString);

//? Створити змінну з іменем myNumber і присвоїти їй довільне числове значення.
//? Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.

//! Код виконаного завдання

const myNumber = 465 + 10;

console.log("My favorite number is", myNumber);

//? Створити змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль.

//! Код виконаного завдання

const myNull = null;

console.log(myNull)

//? Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt().
//? Після введення імені вивести повідомлення привітання з використанням введеного імені.

//! Код виконаного завдання

let name1 = prompt("Введіть своє ім'я:");
console.log(name1);

//? Створити скрипт який виводить спливаюче підтвердження за допомогою confirm().
//? Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!".
//? Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

//! Код виконаного завдання

const approve = confirm("Підтвердіть дію");
approve
    ? alert("Дякую за підтвердження!")
    : alert("Дію відмінено!")

console.log(approve)

//? Створити скрипт який виводить спливаюче попередження за допомогою alert().
//? Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm().
//? Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!".
//? Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!"

//! Код виконаного завдання

alert("Дія небезпечна, тому просимо підтвердити свої дії")
const atention = confirm("Чи підтверджуєте свої дії?")
atention
    ? alert("Дякую за підтвердження!")
    : alert("Дію відмінено!")

console.log(atention);